
# ITA_TZ_02.2.1_DataIngest_MT5Connector_v1.3

**Тип:** Техническое задание (ТЗ)  
**Модуль:** 02_CoreData  
**Подмодуль:** 2.2.1 Data Ingest (MT5Connector)  
**Версия:** 1.3 (восстановленная и расширенная)  
**Дата обновления:** 2025-11-10  

---

## 1. 🎯 Цель подмодуля

Обеспечить получение, проверку и сохранение котировочных данных (OHLCV, ticks) из терминала MetaTrader5 через Python API, 
с гарантией целостности данных, корректной временной метки и поддержкой интеграции с SetupManager, Prefect FlowController и Market Tools.

Модуль является частью системы **CoreData**, которая отвечает за сбор и предобработку рыночных данных.

---

## 2. 📡 Основные функции

1. Подключение к локальному MT5-терминалу через Python API (`MetaTrader5`).
2. Получение OHLCV-баров и тиков по параметрам:
   ```python
   get_ohlcv(symbol, timeframe, start, end) -> pd.DataFrame
   ```
3. Форматирование данных в `pandas.DataFrame` со структурой:
   ```text
   ["time", "open", "high", "low", "close", "volume"]
   ```
4. Все метки времени должны быть в UTC (`datetime64[ns, UTC]`).
5. Проверка целостности данных:
   - отсутствие пропусков и NaN;
   - сортировка по времени;
   - правильный формат datetime.
6. Сохранение результатов в `/data/archive/raw/{symbol}/{tf}/` в формате Parquet.
7. При ошибках соединения — fallback к **CSV/Archive Loader**.
8. Логирование всех этапов выполнения.
9. Возврат JSON-отчёта о статусе выполнения в Prefect Flow.

---

## 3. ⚙️ Входные данные

### 3.1 SetupContext JSON (от SetupManager)
```json
{
  "symbol": "GER40",
  "timeframe": "M15",
  "date_start": "2025-04-01",
  "date_end": "2025-05-31",
  "mode": "BACKTEST",
  "prefect_context_id": "run-001"
}
```

### 3.2 ENV-переменные
```
MT5_LOGIN=XXXXXXX
MT5_PASSWORD=XXXXXXX
MT5_SERVER=MetaQuotes-Demo
```

### 3.3 Prefect Task Trigger
- Task контекст с ID и параметрами.
- Flow ID используется для логирования и мониторинга.

---

## 4. 📤 Выходные данные

1. DataFrame OHLCV (pandas)
2. Архивный файл:  
   `data/archive/raw/{symbol}/{tf}/{YYYY_MM_DD}_{YYYY_MM_DD}.parquet`
3. JSON-отчёт Prefect:
   ```json
   {
     "context_id": "run-001",
     "status": "SUCCESS",
     "rows": 34560,
     "path": "data/archive/raw/GER40_M15_2025-04-01_2025-05-31.parquet",
     "integrity": "ok"
   }
   ```

---

## 5. 🔁 Логика работы и последовательность

1. Получение входных параметров из SetupContext JSON.  
2. Проверка наличия готового архива через `data_cache_manager`.  
   - Если диапазон уже покрыт архивом — использовать кешированные данные.  
   - Иначе перейти к загрузке из MT5.  
3. Подключение к MetaTrader5 API:
   ```python
   if not MT5.initialize(login, password, server):
       raise ConnectionError("MT5 initialization failed")
   ```
4. Получение данных:
   ```python
   rates = MT5.copy_rates_range(symbol, timeframe, start, end)
   df = pd.DataFrame(rates)
   df["time"] = pd.to_datetime(df["time"], unit="s", utc=True)
   ```
5. Проверка целостности временных рядов:
   - отсутствие NaN;
   - временные шаги равномерны;
   - диапазон данных совпадает с запросом.
6. Сохранение результатов в архив (Parquet) и JSON метаданных.
7. Передача статуса в Prefect Flow:
   ```python
   prefect_context.report(
       status="SUCCESS",
       path=output_path,
       rows=len(df),
       integrity="ok"
   )
   ```

---

## 6. ✅ Проверки и валидация

| Проверка | Критерий |
|-----------|-----------|
| Диапазон дат | `start ≤ end` |
| Покрытие кэшем | проверяется через `data_cache_manager` |
| Целостность временных рядов | отсутствие разрывов и NaN |
| Сортировка | строго возрастающая по `time` |
| Размер данных | в пределах ожидаемого диапазона |
| UTC-метки | tz-aware, `datetime64[ns, UTC]` |

---

## 7. 🧠 Интеграция с Prefect Flow

- Модуль реализуется как `@task(prefect)`.
- Передаёт JSON отчёт по завершению работы.
- В случае ошибок — статус `FAILED` и traceback в отчёте Prefect.
- Поддерживается `context_id` для связывания задач внутри Flow.

---

## 8. 🔄 Режимы работы

| Режим | Источник | Назначение |
|-------|-----------|------------|
| BACKTEST | MetaQuotes-Demo / архив | Получение исторических данных |
| LIVE | Торговый терминал | Потоковое обновление данных в реальном времени |

Реализуется heartbeat (ping-check каждые N секунд) для проверки связи в режиме LIVE.

---

## 9. 🧾 Логирование

Логирование через `loguru`, формат:
```
[CONFIG] - настройка окружения
[CACHE] - работа с архивами и кешем
[MT5] - соединение с терминалом
[CHECK] - проверки целостности
[ARCHIVE] - сохранение данных
[PREFECT] - статус задачи
```

---

## 10. ⚠️ Ошибки и fallback

- В режиме DEBUG разрешено использовать fallback к CSV loader.
- В рабочем режиме ошибки конфигурации или соединения останавливают задачу (`raise CriticalError`).
- Все ошибки пишутся в лог и возвращаются в JSON отчёте Prefect.

---

## 11. 🧪 Тестирование

Тестирование проводится через эмулятор SetupManager (скрипт `test_mt5connector_emulator.py`):
1. Формирует SetupContext JSON.
2. Запускает выполнение MT5Connector.
3. Проверяет:
   - корректность диапазона;
   - отсутствие пропусков;
   - успешное формирование parquet;
   - корректный JSON отчёт Prefect.
4. Сохраняет результаты в `/logs/test_runs/`.

---

## 12. 🧩 Пример интеграции

```python
from prefect import flow, task
from coredata.mt5_connector import run_mt5_ingest

@flow(name="BacktestFlow")
def backtest_flow():
    ctx = load_setup_context("GER40", "M15", "2025-04-01", "2025-05-31")
    result = run_mt5_ingest(ctx)
    print(result["status"], result["path"])

if __name__ == "__main__":
    backtest_flow()
```

---

## 13. 📚 Дополнительные требования

- Код должен быть совместим с Python 3.11+.
- Поддерживать работу в Windows и Linux окружениях.
- Логи и архивы должны иметь унифицированные пути.
- Все временные данные хранятся в `/data/cache/`.
- Модуль не должен содержать абсолютных путей.

---

**Автор:** Dreyk / ITA Engineering Team  
**Архитектор:** GPT-5 (ITA Docs Analysis Layer)  
**Версия документа:** 1.3 (Полное восстановление и расширение)
